open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/include/bk7258_image_layout.h
/* SPDX-License-Identifier: Apache-2.0 */
#ifndef __ARCH_ARM_SRC_BK7258_INCLUDE_BK7258_IMAGE_LAYOUT_H
#define __ARCH_ARM_SRC_BK7258_INCLUDE_BK7258_IMAGE_LAYOUT_H

#include <bk7258_partitions.h>

#include "bk7258_flash_remap.h"

#ifdef __cplusplus
#  define BK7258_IMAGE_LAYOUT_STATIC_ASSERT static_assert
#else
#  define BK7258_IMAGE_LAYOUT_STATIC_ASSERT _Static_assert
#endif

#define BK7258_FLASH_RAW_SIZE             BK7258_FLASH_SIZE

#define BK7258_BOOT_FLASH_OFFSET          BK7258_ARTIFACT_BOOT_LOGICAL_OFFSET
#define BK7258_BOOT_FLASH_SIZE            BK7258_ARTIFACT_BOOT_LOGICAL_SIZE

#define BK7258_CP_FLASH_OFFSET            BK7258_ARTIFACT_CP_LOGICAL_OFFSET
#define BK7258_CP_FLASH_SIZE              BK7258_ARTIFACT_CP_LOGICAL_SIZE
#define BK7258_CP_RAW_PHYSICAL_START      BK7258_ARTIFACT_CP_OFFSET
#define BK7258_CP_RAW_PHYSICAL_SIZE       BK7258_ARTIFACT_CP_SIZE

#define BK7258_AP_FLASH_OFFSET            BK7258_ARTIFACT_AP_LOGICAL_OFFSET
#define BK7258_AP_FLASH_SIZE              BK7258_ARTIFACT_AP_LOGICAL_SIZE
#define BK7258_AP_FLASH_ADDR              BK7258_ARTIFACT_AP_XIP_START
#define BK7258_MCUBOOT_HEADER_SIZE         0x200u
#ifdef CONFIG_BK7258_MCUBOOT_IMAGE
#  define BK7258_AP_VECTOR_ADDR           \
    (BK7258_ARTIFACT_AP_XIP_START + BK7258_MCUBOOT_HEADER_SIZE)
#else
#  define BK7258_AP_VECTOR_ADDR           BK7258_ARTIFACT_AP_XIP_START
#endif
#define BK7258_AP_RAW_PHYSICAL_START      BK7258_ARTIFACT_AP_OFFSET
#define BK7258_AP_RAW_PHYSICAL_SIZE       BK7258_ARTIFACT_AP_SIZE

#define BK7258_AB_SECONDARY_START         BK7258_ARTIFACT_PAIR_OFFSET
#define BK7258_AB_SECONDARY_SIZE          BK7258_ARTIFACT_PAIR_SIZE
#define BK7258_AB_SECONDARY_CP_RAW_START  BK7258_AB_SECONDARY_START
#define BK7258_AB_SECONDARY_AP_RAW_START  \
  (BK7258_AB_SECONDARY_START + BK7258_CP_RAW_PHYSICAL_SIZE)
#define BK7258_AB_SECONDARY_CP_XIP_START  \
  (BK7258_FLASH_XIP_BASE + \
   BK7258_CRC_LOGICAL_OFFSET(BK7258_AB_SECONDARY_CP_RAW_START))
#define BK7258_AB_SECONDARY_AP_XIP_START  \
  (BK7258_FLASH_XIP_BASE + \
   BK7258_CRC_LOGICAL_OFFSET(BK7258_AB_SECONDARY_AP_RAW_START))

/* The selected secondary CP/AP pair is linked for the primary execution
 * window.  BL2 programs this chip remapper before handing off a secondary
 * pair; CP can read the same retained registers to identify the physical
 * active slot without a second persistent boot-state owner. */

#define BK7258_AB_REMAP_BEGIN             BK7258_ARTIFACT_CP_XIP_START
#define BK7258_AB_REMAP_END               BK7258_ARTIFACT_AP_XIP_END
#define BK7258_AB_REMAP_OFFSET            \
  (BK7258_AB_SECONDARY_CP_XIP_START - BK7258_ARTIFACT_CP_LOGICAL_OFFSET)

#define BK7258_USR_CONFIG_START           BK7258_PARTITION_USR_CONFIG_OFFSET
#define BK7258_USR_CONFIG_SIZE            BK7258_PARTITION_USR_CONFIG_SIZE
#define BK7258_RESET_MARKER_START         \
  BK7258_PARTITION_RESET_MARKER_OFFSET
#define BK7258_RESET_MARKER_SIZE          BK7258_PARTITION_RESET_MARKER_SIZE
#ifdef BK7258_PARTITION_PERSISTENT_DATA_OFFSET
#  define BK7258_DATA_RAW_PHYSICAL_OFFSET \
    BK7258_PARTITION_PERSISTENT_DATA_OFFSET
#  define BK7258_DATA_RAW_PHYSICAL_SIZE \
    BK7258_PARTITION_PERSISTENT_DATA_SIZE
#endif

BK7258_IMAGE_LAYOUT_STATIC_ASSERT(
  BK7258_USR_CONFIG_START + BK7258_USR_CONFIG_SIZE <=
  BK7258_RESET_MARKER_START,
  "reset marker must not overlap vendor user configuration");
#define BK7258_CALIBRATION_TAIL_START     BK7258_PARTITION_EASYFLASH_OFFSET

#define BK7258_BL2_FLASH_ADDR             BK7258_ARTIFACT_BL2_A_XIP_START
#define BK7258_BL2_SECONDARY_FLASH_ADDR   BK7258_ARTIFACT_BL2_B_XIP_START
#define BK7258_BL2_EXEC_RAM_BASE          0x28020000u
#define BK7258_BL2_EXEC_RAM_SIZE          0x00020000u
#define BK7258_BL2_EXEC_RAM_END           \
  (BK7258_BL2_EXEC_RAM_BASE + BK7258_BL2_EXEC_RAM_SIZE)

#define BK7258_CRC_PHYSICAL_OFFSET(value) \
  (((value) / BK7258_FLASH_CRC_DATA_SIZE) * BK7258_FLASH_CRC_TOTAL_SIZE)

#define BK7258_CRC_LOGICAL_OFFSET(value) \
  (((value) / BK7258_FLASH_CRC_TOTAL_SIZE) * BK7258_FLASH_CRC_DATA_SIZE)

BK7258_IMAGE_LAYOUT_STATIC_ASSERT(
  BK7258_CP_FLASH_OFFSET + BK7258_CP_FLASH_SIZE == BK7258_AP_FLASH_OFFSET,
  "CP/AP logical images must be contiguous");
BK7258_IMAGE_LAYOUT_STATIC_ASSERT(
  BK7258_CP_RAW_PHYSICAL_START + BK7258_CP_RAW_PHYSICAL_SIZE ==
  BK7258_AP_RAW_PHYSICAL_START,
  "CP/AP physical images must be contiguous");
BK7258_IMAGE_LAYOUT_STATIC_ASSERT(
  BK7258_AP_RAW_PHYSICAL_START + BK7258_AP_RAW_PHYSICAL_SIZE ==
  BK7258_AB_SECONDARY_START,
  "primary images must end at the secondary pair");
BK7258_IMAGE_LAYOUT_STATIC_ASSERT(
  BK7258_CP_RAW_PHYSICAL_SIZE + BK7258_AP_RAW_PHYSICAL_SIZE ==
  BK7258_AB_SECONDARY_SIZE,
  "secondary pair must match CP+AP physical size");
#ifdef BK7258_PARTITION_PERSISTENT_DATA_OFFSET
BK7258_IMAGE_LAYOUT_STATIC_ASSERT(
  BK7258_DATA_RAW_PHYSICAL_OFFSET + BK7258_DATA_RAW_PHYSICAL_SIZE <=
  BK7258_CALIBRATION_TAIL_START,
  "data partition must not overlap the immutable tail");
#endif

#undef BK7258_IMAGE_LAYOUT_STATIC_ASSERT

#endif /* __ARCH_ARM_SRC_BK7258_INCLUDE_BK7258_IMAGE_LAYOUT_H */
